XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/cci_reg.h
    /* 0x4 : cci_addr */
    union {
        struct {
            uint32_t apb_cci_addr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cci_addr;

    /* 0x8 : cci_wdata */
    union {
        struct {
            uint32_t apb_cci_wdata : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cci_wdata;

    /* 0xC : cci_rdata */
    union {
        struct {
            uint32_t apb_cci_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } cci_rdata;

    /* 0x10 : cci_ctl */
    union {
        struct {
            uint32_t cci_write_flag : 1;  /* [    0],          r,        0x0 */
            uint32_t cci_read_flag  : 1;  /* [    1],          r,        0x0 */
            uint32_t ahb_state      : 2;  /* [ 3: 2],          r,        0x0 */
            uint32_t reserved_4_31  : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cci_ctl;

    /* 0x14  reserved */
    uint8_t RESERVED0x14[1852];

    /* 0x750 : audio_pll_cfg0 */
    union {
        struct {
            uint32_t aupll_sdm_rstb     : 1;  /* [    0],        r/w,        0x1 */
            uint32_t aupll_postdiv_rstb : 1;  /* [    1],        r/w,        0x1 */
            uint32_t aupll_fbdv_rstb    : 1;  /* [    2],        r/w,        0x1 */
            uint32_t aupll_refdiv_rstb  : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pu_aupll_postdiv   : 1;  /* [    4],        r/w,        0x1 */
            uint32_t pu_aupll_fbdv      : 1;  /* [    5],        r/w,        0x1 */
            uint32_t pu_aupll_clamp_op  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t pu_aupll_pfd       : 1;  /* [    7],        r/w,        0x1 */
            uint32_t pu_aupll_cp        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_aupll_sfreg     : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_aupll           : 1;  /* [   10],        r/w,        0x0 */
            uint32_t pu_aupll_clktree   : 1;  /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31     : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg0;

    /* 0x754 : audio_pll_cfg1 */
    union {
        struct {
            uint32_t aupll_postdiv      : 7; /* [ 6: 0],        r/w,       0x12 */
            uint32_t reserved_7         : 1; /* [    7],       rsvd,        0x0 */
            uint32_t aupll_refdiv_ratio : 4; /* [11: 8],        r/w,        0x4 */
            uint32_t reserved_12_15     : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t aupll_refclk_sel   : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19     : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t aupll_vg11_sel     : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23     : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t aupll_vg13_sel     : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31     : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg1;

    /* 0x758 : audio_pll_cfg2 */
    union {
        struct {
            uint32_t aupll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3        : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t aupll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t aupll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x1 */
            uint32_t aupll_int_frac_sw   : 1;  /* [    8],        r/w,        0x1 */
            uint32_t aupll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t aupll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31      : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg2;

    /* 0x75C : audio_pll_cfg3 */
    union {
        struct {
            uint32_t aupll_c4_en    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3   : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t aupll_r4       : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7   : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t aupll_r4_short : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11  : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t aupll_c3       : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t aupll_cz       : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t aupll_rz       : 3;  /* [18:16],        r/w,        0x5 */
            uint32_t reserved_19_31 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg3;

    /* 0x760 : audio_pll_cfg4 */
    union {
        struct {
            uint32_t aupll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3         : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t aupll_sel_fb_clk     : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t aupll_sdmclk_sel     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31        : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg4;

    /* 0x764 : audio_pll_cfg5 */
    union {
        struct {
            uint32_t aupll_vco_speed : 3;  /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg5;

    /* 0x768 : audio_pll_cfg6 */
    union {
        struct {
            uint32_t aupll_sdmin      : 19; /* [18: 0],        r/w,    0x161e5 */
            uint32_t reserved_19_23   : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t aupll_sdm_bypass : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31   : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg6;

    /* 0x76C : audio_pll_cfg7 */
    union {
        struct {
            uint32_t aupll_sdm_order_sel    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_15          : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t aupll_sdm_sig_dith_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31         : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg7;

    /* 0x770 : audio_pll_cfg8 */
    union {
        struct {
            uint32_t aupll_en_div1       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t aupll_en_div2       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t aupll_en_div2p5     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t aupll_en_div3       : 1;  /* [    3],        r/w,        0x0 */
            uint32_t aupll_en_div4       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t aupll_en_div5       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t aupll_en_div6       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t aupll_en_div10      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t aupll_en_div15      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t aupll_sel_div1_div2 : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31      : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg8;

    /* 0x774 : audio_pll_cfg9 */
    union {
        struct {
            uint32_t aupll_dc_tp_out_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ten_aupll              : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ten_aupll_sfreg        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3             : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t dten_aupll_fin         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_aupll_fref        : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dten_aupll_fsdm        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t dten_aupll_div15       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t dten_aupll_div5        : 1;  /* [    8],        r/w,        0x0 */
            uint32_t dten_aupll_postdiv_clk : 1;  /* [    9],        r/w,        0x0 */
            uint32_t dtest_aupll_pulldown   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31         : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg9;

    /* 0x778 : audio_pll_cfg10 */
    union {
        struct {
            uint32_t aupll_ssc_en            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3            : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t aupll_ssc_cnt           : 8;  /* [11: 4],        r/w,       0x64 */
            uint32_t aupll_ssc_gain          : 3;  /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15             : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t aupll_ssc_start_gate_en : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19          : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t aupll_ssc_start         : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31          : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg10;

    /* 0x77C : audio_pll_cfg11 */
    union {
        struct {
            uint32_t aupll_resv        : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_22    : 7;  /* [22:16],       rsvd,        0x0 */
            uint32_t aupll_dl_ctrl_15  : 1;  /* [   23],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_10  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_6   : 1;  /* [   25],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_5   : 1;  /* [   26],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_4   : 1;  /* [   27],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_3   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_2p5 : 1;  /* [   29],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_2   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t aupll_dl_ctrl_1   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_pll_cfg11;

    /* 0x780  reserved */
    uint8_t RESERVED0x780[80];

    /* 0x7D0 : cpu_pll_cfg0 */
    union {
        struct {
            uint32_t cpupll_sdm_rstb     : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cpupll_postdiv_rstb : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cpupll_fbdv_rstb    : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cpupll_refdiv_rstb  : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pu_cpupll_postdiv   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pu_cpupll_fbdv      : 1;  /* [    5],        r/w,        0x1 */
            uint32_t pu_cpupll_clamp_op  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t pu_cpupll_pfd       : 1;  /* [    7],        r/w,        0x1 */
            uint32_t pu_cpupll_cp        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_cpupll_sfreg     : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_cpupll           : 1;  /* [   10],        r/w,        0x0 */
            uint32_t pu_cpupll_clktree   : 1;  /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31      : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg0;

    /* 0x7D4 : cpu_pll_cfg1 */
    union {
        struct {
            uint32_t cpupll_postdiv      : 7; /* [ 6: 0],        r/w,       0x18 */
            uint32_t reserved_7          : 1; /* [    7],       rsvd,        0x0 */
            uint32_t cpupll_refdiv_ratio : 4; /* [11: 8],        r/w,        0x4 */
            uint32_t reserved_12_15      : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t cpupll_refclk_sel   : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19      : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t cpupll_vg11_sel     : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t cpupll_vg13_sel     : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31      : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg1;

