XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/cci_reg.h
    /* 0x7D8 : cpu_pll_cfg2 */
    union {
        struct {
            uint32_t cpupll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cpupll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t cpupll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x1 */
            uint32_t cpupll_int_frac_sw   : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cpupll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cpupll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg2;

    /* 0x7DC : cpu_pll_cfg3 */
    union {
        struct {
            uint32_t cpupll_c4_en    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3    : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cpupll_r4       : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7    : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cpupll_r4_short : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11   : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t cpupll_c3       : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t cpupll_cz       : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t cpupll_rz       : 3;  /* [18:16],        r/w,        0x5 */
            uint32_t reserved_19_31  : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg3;

    /* 0x7E0 : cpu_pll_cfg4 */
    union {
        struct {
            uint32_t cpupll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3          : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t cpupll_sel_fb_clk     : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7          : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cpupll_sdmclk_sel     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31         : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg4;

    /* 0x7E4 : cpu_pll_cfg5 */
    union {
        struct {
            uint32_t cpupll_vco_speed : 3;  /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3_31    : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg5;

    /* 0x7E8 : cpu_pll_cfg6 */
    union {
        struct {
            uint32_t cpupll_sdmin      : 19; /* [18: 0],        r/w,    0x161e5 */
            uint32_t reserved_19_23    : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t cpupll_sdm_bypass : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31    : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg6;

    /* 0x7EC : cpu_pll_cfg7 */
    union {
        struct {
            uint32_t cpupll_sdm_order_sel    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_15           : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t cpupll_sdm_sig_dith_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31          : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg7;

    /* 0x7F0 : cpu_pll_cfg8 */
    union {
        struct {
            uint32_t cpupll_en_div1       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cpupll_en_div2       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cpupll_en_div2p5     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cpupll_en_div3       : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cpupll_en_div4       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cpupll_en_div5       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cpupll_en_div6       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cpupll_en_div10      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cpupll_en_div15      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cpupll_sel_div1_div2 : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31       : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg8;

    /* 0x7F4 : cpu_pll_cfg9 */
    union {
        struct {
            uint32_t cpupll_dc_tp_out_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ten_cpupll              : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ten_cpupll_sfreg        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3              : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t dten_cpupll_fin         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_cpupll_fref        : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dten_cpupll_fsdm        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t dten_cpupll_div15       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t dten_cpupll_div5        : 1;  /* [    8],        r/w,        0x0 */
            uint32_t dten_cpupll_postdiv_clk : 1;  /* [    9],        r/w,        0x0 */
            uint32_t dtest_cpupll_pulldown   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31          : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg9;

    /* 0x7F8 : cpu_pll_cfg10 */
    union {
        struct {
            uint32_t cpupll_ssc_en            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3             : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cpupll_ssc_cnt           : 8;  /* [11: 4],        r/w,       0x64 */
            uint32_t cpupll_ssc_gain          : 3;  /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15              : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t cpupll_ssc_start_gate_en : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19           : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t cpupll_ssc_start         : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31           : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg10;

    /* 0x7FC : cpu_pll_cfg11 */
    union {
        struct {
            uint32_t cpupll_resv        : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_22     : 7;  /* [22:16],       rsvd,        0x0 */
            uint32_t cpupll_dl_ctrl_15  : 1;  /* [   23],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_10  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_6   : 1;  /* [   25],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_5   : 1;  /* [   26],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_4   : 1;  /* [   27],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_3   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_2p5 : 1;  /* [   29],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_2   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t cpupll_dl_ctrl_1   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cpu_pll_cfg11;
};

typedef volatile struct cci_reg cci_reg_t;

#endif /* __CCI_REG_H__ */
